In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [3]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'songplays' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
7 rows affected.

[('songplay_id', 'NO', 'integer'),
 ('start_time', 'NO', 'bigint'),
 ('user_id', 'NO', 'character varying'),
 ('song_id', 'YES', 'character varying'),
 ('session_id', 'NO', 'integer'),
 ('location', 'YES', 'character varying'),
 ('user_agent', 'YES', 'character varying')]

In [4]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'users' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('user_id', 'NO', 'character varying'),
 ('first_name', 'NO', 'character varying'),
 ('last_name', 'NO', 'character varying'),
 ('gender', 'YES', 'character varying'),
 ('level', 'NO', 'character varying')]

In [5]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'songs' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('song_id', 'NO', 'character varying'),
 ('title', 'NO', 'character varying'),
 ('artist_id', 'NO', 'character varying'),
 ('year', 'YES', 'integer'),
 ('duration', 'NO', 'double precision')]

In [6]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'artists' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('artist_id', 'NO', 'character varying'),
 ('artist_name', 'NO', 'character varying'),
 ('artist_location', 'YES', 'character varying'),
 ('artist_latitude', 'YES', 'double precision'),
 ('artist_longitude', 'YES', 'double precision')]

In [7]:
%sql SELECT column_name, is_nullable, data_type FROM information_schema.columns WHERE table_name = 'time' ORDER BY ordinal_position;

 * postgresql://student:***@127.0.0.1/sparkifydb
7 rows affected.

[('start_time', 'NO', 'bigint'),
 ('hour', 'NO', 'integer'),
 ('day', 'NO', 'integer'),
 ('week', 'NO', 'integer'),
 ('month', 'NO', 'integer'),
 ('year', 'NO', 'integer'),
 ('weekday', 'NO', 'integer')]

In [8]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 1542501201796, '83', 'NULL', 693, 'Lubbock, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, 1542504124796, '40', 'NULL', 555, 'Oxnard-Thousand Oaks-Ventura, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (3, 1542526744796, '40', 'NULL', 698, 'Oxnard-Thousand Oaks-Ventura, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (4, 1542529091796, '79', 'NULL', 78, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0)'),
 (5, 1542539761796, '29', 'NULL', 589, 'Atlanta-Sandy Springs-Roswell, GA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [9]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('83', 'Stefany', 'White', 'F', 'free'),
 ('40', 'Tucker', 'Garrison', 'M', 'free'),
 ('79', 'James', 'Martin', 'M', 'free'),
 ('29', 'Jacqueline', 'Lynch', 'F', 'paid'),
 ('35', 'Molly', 'Taylor', 'F', 'free')]

In [10]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, 114.78159),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, 189.57016),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 209.60608),
 ('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, 177.47546),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, 266.39628)]

In [11]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', None, None),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', None, None),
 ('ARXR32B1187FB57099', 'Gob', '', None, None),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', None, None),
 ('ARNTLGG11E2835DDB9', 'Clp', '', None, None)]

In [12]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1542501201796, 0, 18, 46, 11, 2018, 6),
 (1542504124796, 1, 18, 46, 11, 2018, 6),
 (1542526744796, 7, 18, 46, 11, 2018, 6),
 (1542529091796, 8, 18, 46, 11, 2018, 6),
 (1542539761796, 11, 18, 46, 11, 2018, 6)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).